# Importing Libraries

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# Loading Dataset

In [5]:
df = pd.read_csv('tweets.csv')
df.head()

,id,keyword,location,text,target
0,0,ablaze,NaN,"Communal violence in Bhainsa, Telangana. ""Ston...",1
1,1,ablaze,NaN,Telangana: Section 144 has been imposed in Bha...,1
2,2,ablaze,New York City,Arsonist sets cars ablaze at dealership https:...,1
3,3,ablaze,"Morgantown, WV",Arsonist sets cars ablaze at dealership https:...,1
4,4,ablaze,NaN,"""Lord Jesus, your love brings freedom and pard...",0

# Basic Information

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11370 entries, 0 to 11369
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        11370 non-null  int64
 1   keyword   11370 non-null  object
 2   location  7952 non-null   object
 3   text      11370 non-null  object
 4   target    11370 non-null  int64
dtypes: int64(2), object(3)
memory usage: 444.3+ KB

In [7]:
df.describe()

                 id        target
count  11370.000000  11370.000000
mean    5684.500000      0.185928
std     3282.380615      0.389066
min        0.000000      0.000000
25%     2842.250000      0.000000
50%     5684.500000      0.000000
75%     8526.750000      0.000000
max    11369.000000      1.000000

In [12]:
df.describe(exclude='number')

,keyword,location,text
count,11370,7952,11370
unique,219,4504,11223
top,thunderstorm,United States,I want to help you with my project to save the...
freq,93,96,3

In [8]:
# Getting numerical columns
df.select_dtypes('number').columns

Index(['id', 'target'], dtype='object')

In [10]:
# Getting Categorical Columns
df.select_dtypes(exclude='number').columns

Index(['keyword', 'location', 'text'], dtype='object')

In [11]:
# Knowing Shape of the Dataset
df.shape

(11370, 5)

# Dropping unwanted columns

In [17]:
df.drop('id', axis=1, inplace=True)

In [18]:
df.head()

,keyword,location,text,target
0,ablaze,NaN,"Communal violence in Bhainsa, Telangana. ""Ston...",1
1,ablaze,NaN,Telangana: Section 144 has been imposed in Bha...,1
2,ablaze,New York City,Arsonist sets cars ablaze at dealership https:...,1
3,ablaze,"Morgantown, WV",Arsonist sets cars ablaze at dealership https:...,1
4,ablaze,NaN,"""Lord Jesus, your love brings freedom and pard...",0

# Handling Missing Values

In [20]:
df.isna().sum()

keyword        0
location    3418
text           0
target         0
dtype: int64

In [24]:
df['location'] = df['location'].ffill()

In [27]:
df['location'] = df['location'].bfill()

In [30]:
df.isna().sum()

keyword     0
location    0
text        0
target      0
dtype: int64

# Handling Text Data